{
"About": {
  "Name": "Zijie Zheng",
  "Currently": "Computer Science Student",
  "Headshot": "student-portrait.png",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Jerry Zheng. I'm a computer science student at Seattle Pacific University. I'm interested in learning about software development and exploring new areas that can expand my skills and knowledge as a programmer. Currently learning C++ language with some experience in Java and Python.<br><br>While I am still learning, I enjoy seeking out new learning opportunities and my network. I believe that it is vital to apply the skills learned in classrooms to real world programming and teamwork that encourages growth."
},
"Contact": {
  "EMail": "zhengz2@spu.edu",
  "Phone": "(206) 480-8664",
  "Portfolio": "https://www.github.com",
  "LinkedIn": "https://www.linkedin.com/in/jerryzhengsoftwareexpert/",
  "GitHub": "https://github.com/JerryZheng-3"
},
"Experience": {
  "ExperienceText": "I was born in the United States but I am a first generation Chinese immigrant. I did not even know about programming until my 8th grade math class where I learned about Scratch and beginneer game development.<br><br>Starting from then, in my high school years, I began to research about what coding really is and took classes that gave me more interest and background knowledge.<br><br>Being a student at Seattle Pacific University has been an incredible experience. It has allowed me to continue in my growth as a programmer but also grow in my faith.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2026",
  "EducationText": "- Experience in programming throughout high school and into university.<br>- Completed lessons outside of university for Java/Python.",
  "Employment": "Code Ninjas Queen Anne",
  "Role": "STEM Instructor",
  "EmploymentText": "- Working in a team environment.<br>- Learning different programming skills and communication.<br>- Teaching children in a respectful and positive space that encourages learning and growth",
  "Skills": ["C++", " Java", " Python"],
  "SkillsText": "Learned C++ and Python in university. Learned Java in high school. Took courses outside of university for both Java and Python.",
  "Resume": "student-resume.pdf"  
},
"Project1": {
    "Title": "Interesting Project 1",
    "Desc": "This is a description of Project One.<br><br>It has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "P1Main.png",
    "DetailImages": ["P1Detail1.png","P1Detail2.png","P1Detail3.png"]
  },
  "Project2": {
    "Title": "Interesting Project 2",
    "Desc": "This is a description of Project Two.<br><br>It also has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "P2Main.png",
    "DetailImages": ["P2Detail1.png","P2Detail2.png","P2Detail3.png","P2Detail4.png"]
  },
  "Project3": {
    "Title": "Interesting Project 3",
    "Desc": "This is a description of Project Three.<br><br>It does not have a GitHub repo or any additional screenshots.",
    "GitHubRepo": "",
    "MainImage": "P3Main.png",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
